snlkuharlocal/src/Documents/ВводОстатковДС/ВводОстатковДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВводОстатковДС</name>
  <registerRecords>AccumulationRegister.ДенежныеСредства</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИБ</name>
    <type>
      <types>CatalogRef.ИБ</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Обнулять</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоУпрСуммы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВводОстатков</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДС</name>
    <attributes>
      <name>БанковскийСчет</name>
      <type>
        <types>CatalogRef.Кассы</types>
        <types>CatalogRef.БанковскиеСчета</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <comment>Сумма</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Курс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаУпр</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/AccumulationRegisters/ДенежныеСредства/ДенежныеСредства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДенежныеСредства</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаУпр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Кассы</types>
      <types>String</types>
      <types>CatalogRef.Контрагенты</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРасходов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Субзатрата</name>
    <type>
      <types>CatalogRef.СубЗатраты</types>
    </type>
  </attributes>
  <dimensions>
    <name>БанковскийСчет</name>
    <type>
      <types>CatalogRef.Кассы</types>
      <types>CatalogRef.БанковскиеСчета</types>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/Documents/ВводОстатковДС/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	ЕстьИзменения		=Модифицированность();	
	НужноВыгружать		=НужноВыгружатьДокумент(ЕстьИзменения,Ссылка,РежимЗаписи,ПометкаУдаления);

	Если Отказ Тогда Возврат КонецЕсли;	
	
	Если НЕ ОбменДанными.Загрузка Тогда
		КонтрольДатыЗапрета(ЭтотОбъект,Отказ);
		МожноЗаписатьДокумент(ЭтотОбъект,Отказ,РежимЗаписи,Истина);
		МожноИзменятьДокумент(ЭтотОбъект,Отказ,Истина);		
		
		Если Отказ Тогда Возврат КонецЕсли; 	
	КонецЕсли;
	
	Если ЕстьИзменения Тогда 
		СуммаДокумента=ДС.Итог("Сумма");	
	КонецЕсли;	
	
	Если НужноВыгружать Тогда
		УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);		
	КонецЕсли;	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт	
	Если ВводОстатков Тогда Возврат КонецЕсли; 
	
	Если Обнулять Тогда
		Запрос=Новый Запрос;
		Запрос.Текст="
		|ВЫБРАТЬ
		|	БанковскийСчет,
		|	Валюта,
		|	СуммаОстаток КАК Сумма
		|ИЗ
		|	РегистрНакопления.ДенежныеСредства.Остатки(&Дата2,БанковскийСчет ССЫЛКА Справочник.Кассы И БанковскийСчет.Владелец=&Подразделение)";		
		
		СписокСчетов=ДС.ВыгрузитьКолонку("БанковскийСчет");
		СписокСчетов.Добавить(Справочники.БанковскиеСчета.ПустаяСсылка());
		СписокСчетов.Добавить(Справочники.Кассы.ПустаяСсылка());
		СписокСчетов.Добавить(Неопределено);
		
		Запрос.УстановитьПараметр("Дата2",МоментВремени());
		Запрос.УстановитьПараметр("СписокСчетов",СписокСчетов);
		Запрос.УстановитьПараметр("Подразделение",Подразделение);		
		
		Выборка=Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Движение=Движения.ДенежныеСредства.Добавить();		
			
			Движение.Период			=Дата;
			
			Движение.ВидДвижения	=ВидДвиженияНакопления.Приход;		
			
			Движение.БанковскийСчет	=Выборка.БанковскийСчет;
			Движение.Валюта			=Выборка.Валюта;
			
			Движение.Сумма			=-Выборка.Сумма;		
		КонецЦикла;		
	КонецЕсли; 
	
	Доллары				=Справочники.Валюты.НайтиПоКоду("840");
	Рубли				=Справочники.Валюты.НайтиПоКоду("810");
	Евро				=Справочники.Валюты.НайтиПоКоду("978");
	
	Для Каждого СтрокаТЧ Из ДС Цикл		
		Движение=Движения.ДенежныеСредства.Добавить();
		
		Движение.Период			=Дата;
		
		Движение.ВидДвижения	=ВидДвиженияНакопления.Приход;
		
		Движение.БанковскийСчет	=СтрокаТЧ.БанковскийСчет;
		Движение.Валюта			=СтрокаТЧ.Валюта;
		
		Если НЕ ТолькоУпрСуммы Тогда
			Движение.Сумма		=СтрокаТЧ.Сумма;
		КонецЕсли;		
		Движение.СуммаУпр		=СтрокаТЧ.СуммаУпр;
		
		Движение.СтатьяДДС		=Справочники.СтатьиЗатрат.ВводОстатков;
		Движение.Комментарий = "Ввод остатков ДС. "+Комментарий;
		
		Движение.СуммаДокумента	=СтрокаТЧ.Сумма;
		Движение.ВалютаДокумента=СтрокаТЧ.Валюта;
	КонецЦикла; 
	
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки

	Если ОбменДанными.Загрузка Тогда
		Движения.ДенежныеСредства.Записать();	
	КонецЕсли; 
КонецПроцедуры
